espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/cbap/sl_bt_cbap.c
// -----------------------------------------------------------------------------
// Private function declarations

// Central device bluetooth event handler.
static void on_event_peripheral(sl_bt_msg_t *evt);
// Peripheral device bluetooth event handler.
static void on_event_central(sl_bt_msg_t *evt);

// Reset CBAP process states, flags and timers.
static void cbap_reset(void);

// Search for a Service UUID in scan report.
static bool find_service_in_advertisement(const uint8_t *scan_data,
                                          uint8_t scan_data_len,
                                          const uint8_t *uuid,
                                          uint8_t uuid_len);

// Start or stop timer for timeout check.
static void set_timeout(bool activate);
// Timer callback.
static void state_timer_cb(sl_simple_timer_t *handle, void *data);

// -----------------------------------------------------------------------------
// Public function definitions

// Initialize the component. Import and validate the device and root certificate.
void sl_bt_cbap_init(void)
{
  sl_status_t sc;
  sc = sl_bt_cbap_lib_init(root_certificate_pem,
                           device_certificate_der,
                           &device_certificate_der_len);
  app_assert_status(sc);
  sl_bt_cbap_log_info("Device certificate verified." APP_LOG_NL);

  cbap_reset();
}

// Start CBAP procedure.
sl_status_t sl_bt_cbap_start(sl_bt_cbap_role_t cbap_role,
                             uint8_t connection_handle)
{
  sl_status_t sc;
  if (IS_PERIPHERAL_IN_PROGRESS || IS_CENTRAL_IN_PROGRESS) {
    return SL_STATUS_IN_PROGRESS;
  }

  role = cbap_role;
  connection = connection_handle;

  if (role == SL_BT_CBAP_ROLE_CENTRAL) {
    // Discover CBAP service on the peripheral device
    sc = sl_bt_gatt_discover_primary_services_by_uuid(connection,
                                                      sizeof(cbap_service_uuid),
                                                      (const uint8_t *)cbap_service_uuid);
    app_assert_status(sc);
    cbap_central_state = SL_BT_CBAP_CENTRAL_DISCOVER_SERVICES;
    sl_bt_cbap_central_on_event(cbap_central_state);
  }

  set_timeout(true);
  return SL_STATUS_OK;
}

// Bluetooth stack event handler.
void sli_bt_cbap_on_event(sl_bt_msg_t *evt)
{
  switch (role) {
    case SL_BT_CBAP_ROLE_PERIPHERAL:
      on_event_peripheral(evt);
      break;
    case SL_BT_CBAP_ROLE_CENTRAL:
      on_event_central(evt);
      break;
  }
}

// Search for a the CBAP Service UUID in scan report.
bool sl_bt_cbap_find_service_in_advertisement(const uint8_t *scan_data,
                                              uint8_t scan_data_len)
{
  return find_service_in_advertisement(scan_data,
                                       scan_data_len,
                                       cbap_service_uuid,
                                       sizeof(cbap_service_uuid));
}

// -----------------------------------------------------------------------------
// Private function definitions

/*******************************************************************************
 * Peripheral device bluetooth event handler.
 ******************************************************************************/
static void on_event_peripheral(sl_bt_msg_t *evt)
{
  sl_status_t sc;
  // Handle stack events
  switch (SL_BT_MSG_ID(evt->header)) {
    // This event indicates the device has started and the radio is ready.
    // Do not call any stack command before receiving this boot event!
    case sl_bt_evt_system_boot_id:
      // Request OOB data from both device
      sc = sl_bt_sm_configure(SL_BT_SM_CONFIGURATION_OOB_FROM_BOTH_DEVICES_REQUIRED,
                              sl_bt_sm_io_capability_noinputnooutput);
      app_assert_status(sc);
      break;

    //--------------------------------
    // Triggered whenever the connection parameters are changed
    case sl_bt_evt_connection_parameters_id:
      if (evt->data.evt_connection_parameters.connection != connection) {
        break;
      }

      sl_bt_cbap_log_debug("Security mode: %i" APP_LOG_NL,
                           evt->data.evt_connection_parameters.security_mode);
      if (evt->data.evt_connection_parameters.security_mode > sl_bt_connection_mode1_level1
          && cbap_peripheral_state != SL_BT_CBAP_PERIPHERAL_CENTRAL_OOB_OK) {
        sl_bt_cbap_log_error("The central device increased the security level with " \
                             "no CBAP. Disconnecting." APP_LOG_NL);
        sl_bt_on_cbap_error();
        cbap_reset();
        break;
      }

      if (evt->data.evt_connection_parameters.security_mode == sl_bt_connection_mode1_level4) {
        cbap_peripheral_state = SL_BT_CBAP_PERIPHERAL_DONE;
        sl_bt_cbap_peripheral_on_event(cbap_peripheral_state);
        cbap_reset();
      }
      break;

    case sl_bt_evt_gatt_server_user_write_request_id:
      if (evt->data.evt_gatt_server_user_write_request.connection != connection) {
        break;
      }

      // Set default response parameters.
      sc = SL_STATUS_BT_ATT_WRITE_REQUEST_REJECTED;
      // Receiving Certificate from central device
      if (evt->data.evt_gatt_server_user_write_request.characteristic == gattdb_central_cert) {
        if (remote_cert_arrived == false) {
          // First byte indicates that it is a last packet or not
          memcpy(&remote_certificate_der[remote_certificate_der_len],
                 &evt->data.evt_gatt_server_user_write_request.value.data[1],
                 evt->data.evt_gatt_server_user_write_request.value.len - 1);
          remote_certificate_der_len += evt->data.evt_gatt_server_user_write_request.value.len - 1;
          sc = SL_STATUS_OK;
          if (evt->data.evt_gatt_server_user_write_request.value.data[0] == 0) {
            // Last packet of the remote cert arrived
            sl_bt_cbap_log_info("Getting certificate from central." APP_LOG_NL);
            remote_cert_arrived = true;
            sc = sl_bt_cbap_lib_process_remote_cert(remote_certificate_der,
                                                    remote_certificate_der_len);
            if (sc == SL_STATUS_OK) {
              app_assert(cbap_peripheral_state == SL_BT_CBAP_PERIPHERAL_IDLE,
                         "Unexpected peripheral state.");
              cbap_peripheral_state = SL_BT_CBAP_PERIPHERAL_CENTRAL_CERT_OK;
              sl_bt_cbap_peripheral_on_event(cbap_peripheral_state);
              set_timeout(true);
            } else {
              sl_bt_cbap_log_error("Remote certificate verification failed. " \
                                   "Disconnecting." APP_LOG_NL);
              sl_bt_on_cbap_error();
              cbap_reset();
              break;
            }
          }
          // Map status code to a valid attribute error.
          if (SL_STATUS_OK != sc) {
            sc = SL_STATUS_BT_ATT_WRITE_REQUEST_REJECTED;
          }
        } else {
          sc = SL_STATUS_BT_ATT_PROCEDURE_ALREADY_IN_PROGRESS;
        }
        sl_bt_gatt_server_send_user_write_response(evt->data.evt_gatt_server_user_write_request.connection,
                                                   evt->data.evt_gatt_server_user_write_request.characteristic,
                                                   (uint8_t)sc);
      }
      // Receiving OOB data from central device
      else if (evt->data.evt_gatt_server_user_write_request.characteristic == gattdb_central_oob ) {
        sl_bt_cbap_log_info("Getting OOB data from central." APP_LOG_NL);
        aes_key_128 remote_random;
        aes_key_128 remote_confirm;
        uint8_t remote_oob_signature[OOB_SIGNATURE_LEN];
        memcpy(&remote_random,
               &evt->data.evt_gatt_server_user_write_request.value.data[0],
               sizeof(remote_random));
        memcpy(&remote_confirm,
               &evt->data.evt_gatt_server_user_write_request.value.data[16],
               sizeof(remote_confirm));
        memcpy(&remote_oob_signature,
               &evt->data.evt_gatt_server_user_write_request.value.data[32],
               OOB_SIGNATURE_LEN);

        sc = sl_bt_gatt_server_send_user_write_response(evt->data.evt_gatt_server_user_write_request.connection,
                                                        evt->data.evt_gatt_server_user_write_request.characteristic,
                                                        SL_STATUS_OK);
        app_assert_status(sc);

        sl_bt_cbap_log_debug("Remote OOB data:" APP_LOG_NL);
        sl_bt_cbap_log_hexdump(&remote_random, sizeof(aes_key_128));
        sl_bt_cbap_log_debug(APP_LOG_NL);
        sl_bt_cbap_log_hexdump(&remote_confirm, sizeof(aes_key_128));
        sl_bt_cbap_log_debug(APP_LOG_NL);
        sl_bt_cbap_log_debug("Remote OOB signature:" APP_LOG_NL);
        sl_bt_cbap_log_hexdump(&remote_oob_signature, OOB_SIGNATURE_LEN);
        sl_bt_cbap_log_debug(APP_LOG_NL);

        sc = sl_bt_cbap_lib_verify_remote_oob_data(remote_random.data,
                                                   remote_confirm.data,
                                                   remote_oob_signature);
        app_assert_status(sc);
        sl_bt_cbap_log_info("Remote OOB data verified." APP_LOG_NL);
        sc = sl_bt_sm_set_remote_oob(1, remote_random, remote_confirm);
        app_assert_status(sc);
        sc = sl_bt_cbap_destroy_key();
        app_assert_status(sc);

