espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/cbap/sl_bt_cbap.c
        app_assert(cbap_peripheral_state == SL_BT_CBAP_PERIPHERAL_CENTRAL_CERT_OK,
                   "Unexpected peripheral state.");
        cbap_peripheral_state = SL_BT_CBAP_PERIPHERAL_CENTRAL_OOB_OK;
        sl_bt_cbap_peripheral_on_event(cbap_peripheral_state);
        set_timeout(true);
      }
      break;

    case sl_bt_evt_gatt_server_characteristic_status_id:
      if (evt->data.evt_gatt_server_characteristic_status.connection != connection) {
        break;
      }

      if (gattdb_peripheral_cert == evt->data.evt_gatt_server_characteristic_status.characteristic) {
        if (sl_bt_gatt_server_client_config == (sl_bt_gatt_server_characteristic_status_flag_t)evt->data.evt_gatt_server_characteristic_status.status_flags) {
          if (sl_bt_gatt_indication == (sl_bt_gatt_client_config_flag_t)evt->data.evt_gatt_server_characteristic_status.client_config_flags
              && device_cert_sent == false) {
            uint8_t buff[CERT_IND_CHUNK_LEN + 1];
            buff[0] = 1;
            memcpy(&buff[1], device_certificate_der, CERT_IND_CHUNK_LEN);
            sc = sl_bt_gatt_server_send_indication(connection,
                                                   gattdb_peripheral_cert,
                                                   CERT_IND_CHUNK_LEN + 1,
                                                   buff);
            app_assert_status(sc);
            dev_cert_sending_progression += CERT_IND_CHUNK_LEN;
          }
        }
        // Sending Peripheral certificate to Central device
        else if (sl_bt_gatt_server_confirmation == (sl_bt_gatt_server_characteristic_status_flag_t)evt->data.evt_gatt_server_characteristic_status.status_flags) {
          if (device_cert_sent == false) {
            uint32_t remaining = device_certificate_der_len - dev_cert_sending_progression;
            uint8_t buff[CERT_IND_CHUNK_LEN + 1];
            uint8_t len = 0;
            if (remaining > CERT_IND_CHUNK_LEN) {
              buff[0] = 1;
              len = CERT_IND_CHUNK_LEN + 1;
            } else {
              // Send last chunk
              buff[0] = 0;
              len = remaining + 1;
              device_cert_sent = true;
            }
            memcpy(&buff[1], &device_certificate_der[dev_cert_sending_progression], len - 1);
            dev_cert_sending_progression += len - 1;
            sc = sl_bt_gatt_server_send_indication(connection,
                                                   gattdb_peripheral_cert,
                                                   len,
                                                   buff);
            app_assert_status(sc);
          }
        }
      }
      // Sending Peripheral OOB data to Central device
      else if (gattdb_peripheral_oob == evt->data.evt_gatt_server_characteristic_status.characteristic ) {
        if (sl_bt_gatt_server_client_config == (sl_bt_gatt_server_characteristic_status_flag_t)evt->data.evt_gatt_server_characteristic_status.status_flags
            && sl_bt_gatt_indication == (sl_bt_gatt_client_config_flag_t)evt->data.evt_gatt_server_characteristic_status.client_config_flags) {
          aes_key_128 device_random;
          aes_key_128 device_confirm;
          // Generate device oob data and send over GATT
          sc = sl_bt_sm_set_oob(1, &device_random, &device_confirm);
          app_assert_status(sc);

          sl_bt_cbap_log_debug("Device OOB Data:" APP_LOG_NL);
          sl_bt_cbap_log_hexdump(&device_random, OOB_RANDOM_LEN);
          sl_bt_cbap_log_debug(APP_LOG_NL);
          sl_bt_cbap_log_hexdump(&device_confirm, OOB_RANDOM_LEN);
          sl_bt_cbap_log_debug(APP_LOG_NL);

          sc = sl_bt_cbap_lib_sign_device_oob_data(device_random.data,
                                                   device_confirm.data,
                                                   signed_device_oob_data,
                                                   &signed_device_oob_len);
          app_assert_status(sc);

          sl_bt_cbap_log_debug("Device OOB Signature:" APP_LOG_NL);
          sl_bt_cbap_log_hexdump(&signed_device_oob_data[OOB_DATA_LEN],
                                 OOB_SIGNATURE_LEN);

          sl_bt_cbap_log_debug(APP_LOG_NL);

          sc = sl_bt_gatt_server_send_indication(connection,
                                                 gattdb_peripheral_oob,
                                                 signed_device_oob_len,
                                                 signed_device_oob_data);
          app_assert_status(sc);
        }
      }
      break;
  }
}

/*******************************************************************************
 * Central device bluetooth event handler.
 ******************************************************************************/
static void on_event_central(sl_bt_msg_t *evt)
{
  sl_status_t sc;
  // Handle stack events
  switch (SL_BT_MSG_ID(evt->header)) {
    //--------------------------------
    // Triggered whenever the connection parameters are changed
    case sl_bt_evt_connection_parameters_id:
      if (evt->data.evt_connection_parameters.connection != connection) {
        break;
      }

      sl_bt_cbap_log_debug("Security mode: %i" APP_LOG_NL, evt->data.evt_connection_parameters.security_mode);
      if (evt->data.evt_connection_parameters.security_mode > sl_bt_connection_mode1_level1
          && cbap_central_state != SL_BT_CBAP_CENTRAL_INCREASE_SECURITY) {
        sl_bt_cbap_log_error("Security level has been increased with no CBAP. " \
                             "Disconnecting." APP_LOG_NL);
        sl_bt_on_cbap_error();
        cbap_reset();
        break;
      }

      if (evt->data.evt_connection_parameters.security_mode == sl_bt_connection_mode1_level4) {
        cbap_central_state = SL_BT_CBAP_CENTRAL_DONE;
        sl_bt_cbap_central_on_event(cbap_central_state);
        cbap_reset();
      }
      break;

    // -------------------------------
    // This event is generated when a new service is discovered
    case sl_bt_evt_gatt_service_id:
      if (evt->data.evt_gatt_service.connection != connection) {
        break;
      }

      if (cbap_service_handle == HANDLE_NOT_INITIALIZED) {
        // Save service handle for future reference
        cbap_service_handle = evt->data.evt_gatt_service.service;
        sl_bt_cbap_log_debug("Service handle found: %i" APP_LOG_NL, cbap_service_handle);
      }
      break;

    // -------------------------------
    // This event is generated when a new characteristic is discovered
    case sl_bt_evt_gatt_characteristic_id:
      if (evt->data.evt_gatt_characteristic.connection != connection) {
        break;
      }

      if (cbap_characteristics[char_state].handle == HANDLE_NOT_INITIALIZED) {
        // Save characteristic handle for future reference
        cbap_characteristics[char_state].handle = evt->data.evt_gatt_characteristic.characteristic;
        sl_bt_cbap_log_debug("Characteristic handle found: %i" APP_LOG_NL,
                             cbap_characteristics[char_state].handle);
      }
      break;

    // -------------------------------
    // This event is generated for various procedure completions, e.g. when a
    // write procedure is completed, or service discovery is completed
    case sl_bt_evt_gatt_procedure_completed_id:
      if (evt->data.evt_gatt_procedure_completed.connection != connection) {
        break;
      }

      // Check result
      if (evt->data.evt_gatt_procedure_completed.result != 0) {
        sl_bt_cbap_log_error("GATT procedure failed [E:%i]. Disconnecting." APP_LOG_NL,
                             evt->data.evt_gatt_procedure_completed.result);
        sl_bt_on_cbap_error();
        cbap_reset();
        break;
      }

