espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/cbap/sl_bt_cbap.c
      switch (cbap_central_state) {
        case SL_BT_CBAP_CENTRAL_DISCOVER_SERVICES: {
          // Continue by finding the characteristics under the CBAP service.
          char_state = (characteristics_t)0; // Start with the first characteristic
          sc = sl_bt_gatt_discover_characteristics_by_uuid(evt->data.evt_gatt_procedure_completed.connection,
                                                           cbap_service_handle,
                                                           sizeof(cbap_characteristics[char_state].uuid),
                                                           (const uint8_t *)cbap_characteristics[char_state].uuid);
          app_assert_status(sc);
          cbap_central_state = SL_BT_CBAP_CENTRAL_DISCOVER_CHARACTERISTICS;
          sl_bt_cbap_central_on_event(cbap_central_state);
          set_timeout(true);
          break;
        }

        case SL_BT_CBAP_CENTRAL_DISCOVER_CHARACTERISTICS: {
          char_state++;
          if (char_state < CHAR_NUM) {
            // Find the next characteristic
            sc = sl_bt_gatt_discover_characteristics_by_uuid(evt->data.evt_gatt_procedure_completed.connection,
                                                             cbap_service_handle,
                                                             sizeof(cbap_characteristics[char_state].uuid),
                                                             (const uint8_t *)cbap_characteristics[char_state].uuid);
            app_assert_status(sc);
          } else {
            // Get Peripheral certificates
            sc = sl_bt_gatt_set_characteristic_notification(evt->data.evt_gatt_procedure_completed.connection,
                                                            cbap_characteristics[CHAR_PERIPHERAL_CERT].handle,
                                                            sl_bt_gatt_indication);
            app_assert_status(sc);
            cbap_central_state = SL_BT_CBAP_CENTRAL_GET_PERIPHERAL_CERT;
            sl_bt_cbap_central_on_event(cbap_central_state);
            set_timeout(true);
          }
          break;
        }

        case SL_BT_CBAP_CENTRAL_SEND_CENTRAL_CERT: {
          if (!device_cert_sent) {
            uint32_t remaining = device_certificate_der_len
                                 - dev_cert_sending_progression;
            uint8_t buff[CERT_IND_CHUNK_LEN + 1];
            uint8_t len = 0;
            if (remaining > CERT_IND_CHUNK_LEN) {
              buff[0] = 1;
              memcpy(&buff[1],
                     &device_certificate_der[dev_cert_sending_progression],
                     CERT_IND_CHUNK_LEN);
              dev_cert_sending_progression += CERT_IND_CHUNK_LEN;
              len = CERT_IND_CHUNK_LEN + 1;
            } else {
              // Last chunk
              buff[0] = 0;
              memcpy(&buff[1],
                     &device_certificate_der[dev_cert_sending_progression],
                     remaining);
              len = remaining + 1;
              device_cert_sent = true;
            }
            sc = sl_bt_gatt_write_characteristic_value(connection,
                                                       cbap_characteristics[CHAR_CENTRAL_CERT].handle,
                                                       len,
                                                       buff);
            app_assert_status(sc);
          } else {
            // If certificate exchange completed get OOB data. Enable indication.
            sc = sl_bt_gatt_set_characteristic_notification(evt->data.evt_gatt_procedure_completed.connection,
                                                            cbap_characteristics[CHAR_PERIPHERAL_OOB].handle,
                                                            sl_bt_gatt_indication);
            app_assert_status(sc);
            aes_key_128 device_random;
            aes_key_128 device_confirm;
            // Generate device oob data and send over GATT
            sc = sl_bt_sm_set_oob(1, &device_random, &device_confirm);
            app_assert_status(sc);

            sl_bt_cbap_log_debug("Device OOB Data:" APP_LOG_NL);
            sl_bt_cbap_log_hexdump(&device_random, OOB_RANDOM_LEN);
            sl_bt_cbap_log_debug(APP_LOG_NL);
            sl_bt_cbap_log_hexdump(&device_confirm, OOB_RANDOM_LEN);
            sl_bt_cbap_log_debug(APP_LOG_NL);

            sc = sl_bt_cbap_lib_sign_device_oob_data(device_random.data,
                                                     device_confirm.data,
                                                     signed_device_oob_data,
                                                     &signed_device_oob_len);
            app_assert_status(sc);

            sl_bt_cbap_log_debug("Device OOB Signature:" APP_LOG_NL);
            sl_bt_cbap_log_hexdump(&signed_device_oob_data[OOB_DATA_LEN],
                                   OOB_SIGNATURE_LEN);
            sl_bt_cbap_log_debug(APP_LOG_NL);

            cbap_central_state = SL_BT_CBAP_CENTRAL_GET_PERIPHERAL_OOB;
            sl_bt_cbap_central_on_event(cbap_central_state);
            set_timeout(true);
          }
          break;
        }

        case SL_BT_CBAP_CENTRAL_SEND_OOB: {
          sc = sl_bt_gatt_write_characteristic_value(connection,
                                                     cbap_characteristics[CHAR_CENTRAL_OOB].handle,
                                                     signed_device_oob_len,
                                                     signed_device_oob_data);
          app_assert_status(sc);

          // Request OOB data from both device
          sc = sl_bt_sm_configure(SL_BT_SM_CONFIGURATION_OOB_FROM_BOTH_DEVICES_REQUIRED,
                                  sl_bt_sm_io_capability_noinputnooutput);
          app_assert_status(sc);
          sc = sl_bt_sm_increase_security(connection);
          app_assert_status(sc);

          cbap_central_state = SL_BT_CBAP_CENTRAL_INCREASE_SECURITY;
          sl_bt_cbap_central_on_event(cbap_central_state);
          set_timeout(true);
          break;
        }

        default: {
          break;
        }
      }
      break;

    // -------------------------------
    // This event is generated when a characteristic value was received e.g. an indication
    case sl_bt_evt_gatt_characteristic_value_id:
      if (evt->data.evt_gatt_characteristic_value.connection != connection) {
        break;
      }

