espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/cbap/sl_bt_cbap.c
      if (cbap_central_state == SL_BT_CBAP_CENTRAL_GET_PERIPHERAL_CERT) {
        memcpy(&remote_certificate_der[remote_certificate_der_len],
               &evt->data.evt_gatt_characteristic_value.value.data[1],
               evt->data.evt_gatt_characteristic_value.value.len - 1);
        remote_certificate_der_len += evt->data.evt_gatt_characteristic_value.value.len - 1;
        sc = sl_bt_gatt_send_characteristic_confirmation(evt->data.evt_gatt_characteristic_value.connection);
        app_assert_status(sc);
        if (evt->data.evt_gatt_characteristic_value.value.data[0] == 0) {
          // Last chunk stop indication
          sc = sl_bt_gatt_set_characteristic_notification(connection,
                                                          cbap_characteristics[CHAR_PERIPHERAL_CERT].handle,
                                                          sl_bt_gatt_disable);
          app_assert_status(sc);

          remote_cert_arrived = true;
          cbap_central_state = SL_BT_CBAP_CENTRAL_SEND_CENTRAL_CERT;
          sl_bt_cbap_central_on_event(cbap_central_state);
          set_timeout(true);

          sc = sl_bt_cbap_lib_process_remote_cert(remote_certificate_der,
                                                  remote_certificate_der_len);
          if (sc == SL_STATUS_OK) {
            sl_bt_cbap_log_info("Remote certificate verified." APP_LOG_NL);
          } else {
            sl_bt_cbap_log_error("Remote certificate verification failed. " \
                                 "Disconnecting." APP_LOG_NL);
            sl_bt_on_cbap_error();
            cbap_reset();
            break;
          }
        }
      } else if (cbap_central_state == SL_BT_CBAP_CENTRAL_GET_PERIPHERAL_OOB) {
        aes_key_128 remote_random;
        aes_key_128 remote_confirm;
        uint8_t remote_oob_signature[OOB_SIGNATURE_LEN];
        memcpy(&remote_random,
               &evt->data.evt_gatt_characteristic_value.value.data[0],
               sizeof(aes_key_128));
        memcpy(&remote_confirm,
               &evt->data.evt_gatt_characteristic_value.value.data[16],
               sizeof(aes_key_128));
        memcpy(&remote_oob_signature,
               &evt->data.evt_gatt_server_user_write_request.value.data[32],
               OOB_SIGNATURE_LEN);
        sc = sl_bt_gatt_send_characteristic_confirmation(evt->data.evt_gatt_characteristic_value.connection);
        app_assert_status(sc);
        cbap_central_state = SL_BT_CBAP_CENTRAL_SEND_OOB;
        sl_bt_cbap_central_on_event(cbap_central_state);
        set_timeout(true);
        sc = sl_bt_gatt_set_characteristic_notification(connection,
                                                        cbap_characteristics[CHAR_PERIPHERAL_OOB].handle,
                                                        sl_bt_gatt_disable);
        app_assert_status(sc);

        sl_bt_cbap_log_debug("Remote OOB data:" APP_LOG_NL);
        sl_bt_cbap_log_hexdump(&remote_random, sizeof(aes_key_128));
        sl_bt_cbap_log_debug(APP_LOG_NL);
        sl_bt_cbap_log_hexdump(&remote_confirm, sizeof(aes_key_128));
        sl_bt_cbap_log_debug(APP_LOG_NL);
        sl_bt_cbap_log_debug("Remote OOB signature:" APP_LOG_NL);
        sl_bt_cbap_log_hexdump(&remote_oob_signature, OOB_SIGNATURE_LEN);
        sl_bt_cbap_log_debug(APP_LOG_NL);

        sc = sl_bt_cbap_lib_verify_remote_oob_data(remote_random.data,
                                                   remote_confirm.data,
                                                   remote_oob_signature);
        app_assert_status(sc);
        sl_bt_cbap_log_info("Remote OOB data verified." APP_LOG_NL);
        sc = sl_bt_sm_set_remote_oob(1, remote_random, remote_confirm);
        app_assert_status(sc);
        sc = sl_bt_cbap_destroy_key();
        app_assert_status(sc);
      }
      break;
  }
}

/***************************************************************************//**
 * Reset CBAP process states, flags and timers.
 ******************************************************************************/
static void cbap_reset(void)
{
  set_timeout(false); // Make sure timer is stopped
  connection = SL_BT_INVALID_CONNECTION_HANDLE; // Clear connection handle
  // Reset states
  cbap_peripheral_state = (sl_bt_cbap_peripheral_state_t)0;
  sl_bt_cbap_peripheral_on_event(cbap_peripheral_state);
  cbap_central_state = (sl_bt_cbap_central_state_t)0;
  sl_bt_cbap_central_on_event(cbap_central_state);
  char_state = (characteristics_t)0;
  // Reset flags
  remote_cert_arrived = false;
  device_cert_sent = false;
  remote_certificate_der_len = 0;
  dev_cert_sending_progression = 0;
}

/*******************************************************************************
 * Search for a Service UUID in scan report.
 *
 * @param[in] scan_data Data received in scanner advertisement report event
 * @param[in] scan_data_len Length of the scan data
 * @param[in] uuid Service UUID to search for
 * @param[in] uuid_len Service UUID length
 * @return true if the service is found
 ******************************************************************************/
static bool find_service_in_advertisement(const uint8_t *scan_data,
                                          uint8_t scan_data_len,
                                          const uint8_t *uuid,
                                          uint8_t uuid_len)
{
  uint8_t ad_field_length;
  uint8_t ad_field_type;
  uint8_t i = 0;

  while (i < scan_data_len) {
    // Parse advertisement packet
    ad_field_length = scan_data[i];  // Not counting the length byte itself
    ad_field_type = scan_data[i + 1];
    if ((uuid_len == UUID_16_LEN && (ad_field_type == GAP_INCOMPLETE_16B_UUID
                                     || ad_field_type == GAP_COMPLETE_16B_UUID))
        || (uuid_len == UUID_128_LEN && (ad_field_type == GAP_INCOMPLETE_128B_UUID
                                         || ad_field_type == GAP_COMPLETE_128B_UUID))) {
      // Packet containing the list of complete/incomplete 16/128-bit services found.
      // Loop through the UUID list
      uint8_t j = 2;
      while (j < ad_field_length + 1) {
        // Compare payload.
        if (memcmp(&scan_data[i + j], uuid, uuid_len) == 0) {
          return true;
        }
        // Advance to the next UUID
        j += uuid_len;
      }
    }
    // Advance to the next packet
    i += ad_field_length + 1;
  }
  return false;
}

/***************************************************************************//**
 * Start or stop timer for timeout check.
 * @param[in] activate If true timer will start for timeout check
 ******************************************************************************/
static void set_timeout(bool activate)
{
  sl_status_t sc;
  if (activate) {
    // Start or restart timer to timeout check
    sc = sl_simple_timer_start(&state_timer,
                               TIMEOUT,
                               state_timer_cb,
                               NO_CALLBACK_DATA,
                               false);
    app_assert_status(sc);
  } else {
    // Stop timer
    sc = sl_simple_timer_stop(&state_timer);
    app_assert_status(sc);
  }
}

/***************************************************************************//**
 * Timer Callback.
 * @param[in] handle pointer to handle instance
 * @param[in] data pointer to input data
 ******************************************************************************/
static void state_timer_cb(sl_simple_timer_t *handle, void *data)
{
  (void)handle;
  (void)data;

  sl_bt_cbap_log_error("Timeout error. Disconnecting." APP_LOG_NL);
  sl_bt_on_cbap_error();
  cbap_reset();
}

// CBAP Peripheral event handler WEAK implementation.
SL_WEAK void sl_bt_cbap_peripheral_on_event(sl_bt_cbap_peripheral_state_t status)
{
  (void)status;
}

// CBAP Central event handler WEAK implementation.
SL_WEAK void sl_bt_cbap_central_on_event(sl_bt_cbap_central_state_t status)
{
  (void)status;
}

// Callback to handle CBAP process errors.
SL_WEAK void sl_bt_on_cbap_error(void)
{
  sl_status_t sc;
  sc = sl_bt_connection_close(connection);
  app_assert_status(sc);
}
